#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.external.rabbit_01_psp_token_otp: Reading...
data.onepassword_item.rabbit_01_psp_token: Reading...
tls_private_key.rtmp_key: Refreshing state... [id=dd53b14179e8a4c84f7cad1fa6972b0b89075bec]
tls_private_key.alicloud3_key: Refreshing state... [id=f63af23191753064cf32785a897bf9b0e4143c8a]
tls_private_key.alicloud_key: Refreshing state... [id=2715b21a5b35894000d79cf7965b18307e9258b3]
random_password.webserver_password: Refreshing state... [id=none]
tls_private_key.webserver_key: Refreshing state... [id=81d28d3c476734c1aaf4c71b34dcb2860024d06e]
random_password.rtmp_password: Refreshing state... [id=none]
data.onepassword_item.rabbit_01_psp_token: Read complete after 0s [id=vaults/66qfxcmgwlhutunx6slav6fyve/items/h7fhsftvpum7r4b3rnqznz4lym]
random_password.alicloud3_password: Refreshing state... [id=none]
random_password.alicloud_password: Refreshing state... [id=none]
local_file.rtmp_key_file: Refreshing state... [id=34994146c8d028ca24774dd81d754c8a915cab89]
local_file.alicloud_key_file: Refreshing state... [id=e71958442d331fe590a11c211113b6bc0c601a0f]
local_file.webserver_key_file: Refreshing state... [id=75b14ce05c6a838c5d7461fdb112b503bb8e9dc6]
local_file.alicloud3_key_file: Refreshing state... [id=9cb4b53c3420c0fc6eb951fe0ec7cbe716a41334]
data.external.rabbit_01_psp_token_otp: Read complete after 0s [id=-]
proxmox_virtual_environment_file.alilinux3_cloud_image: Refreshing state... [id=local:iso/aliyun_3_x64_20G_nocloud_alibase_20220907.img]
proxmox_virtual_environment_file.ubuntu2204_cloud_image: Refreshing state... [id=local:iso/jammy-server-cloudimg-amd64.img]
proxmox_virtual_environment_file.debian_cloud_image: Refreshing state... [id=local:iso/debian-11-genericcloud-amd64.img]
proxmox_virtual_environment_file.cloud_config_alicloud3: Refreshing state... [id=local:snippets/alicloud3.cloud-config.yaml]
proxmox_virtual_environment_file.cloud_config_alicloud: Refreshing state... [id=local:snippets/alicloud.cloud-config.yaml]
proxmox_virtual_environment_file.ubuntu2004_cloud_image: Refreshing state... [id=local:iso/focal-server-cloudimg-amd64.img]
proxmox_virtual_environment_file.alilinux_cloud_image: Refreshing state... [id=local:iso/aliyun_2_1903_x64_20G_nocloud_alibase_20220525.img]
proxmox_virtual_environment_file.cloud_config: Refreshing state... [id=local:snippets/ubuntu.cloud-config.yaml]
proxmox_virtual_environment_file.cloud_config_rtmp: Refreshing state... [id=local:snippets/ubuntu-rtmp.cloud-config.yaml]
proxmox_virtual_environment_vm.webserver[1]: Refreshing state... [id=502]
proxmox_virtual_environment_vm.alicloud[0]: Refreshing state... [id=701]
proxmox_virtual_environment_vm.webserver[0]: Refreshing state... [id=501]
proxmox_virtual_environment_vm.rtmp[0]: Refreshing state... [id=601]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # local_file.alicloud3_key_file will be created
  + resource "local_file" "alicloud3_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./alicloud3-ssh.key"
      + id                   = (known after apply)
    }

  # local_file.alicloud_key_file will be created
  + resource "local_file" "alicloud_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./alicloud-ssh.key"
      + id                   = (known after apply)
    }

  # local_file.rtmp_key_file will be created
  + resource "local_file" "rtmp_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./rtmp-ssh.key"
      + id                   = (known after apply)
    }

  # local_file.webserver_key_file will be created
  + resource "local_file" "webserver_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./webserver-ssh.key"
      + id                   = (known after apply)
    }

  # proxmox_virtual_environment_vm.alicloud[0] will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "alicloud" {
        id                      = "701"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "alicloud1.ddlns.net"
      ~ network_interface_names = [] -> (known after apply)
      ~ tags                    = [
          - "alicloud1",
            "automation",
            "ubuntu",
          + "alicloud1",
        ]
        # (18 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.rtmp[0] will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "rtmp" {
        id                      = "601"
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "10.10.20.20",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::60f1:59ff:fe86:4ecc",
            ],
        ] -> (known after apply)
        name                    = "rtmp1.ddlns.net"
      ~ network_interface_names = [
          - "lo",
          - "eth0",
        ] -> (known after apply)
      ~ tags                    = [
            "automation",
          - "rtmp1",
            "ubuntu",
          + "rtmp1",
        ]
        # (18 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.webserver[0] will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "webserver" {
        id                      = "501"
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "10.10.20.129",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::d823:cff:fec5:9eb5",
            ],
        ] -> (known after apply)
        name                    = "web1.ddlns.net"
      ~ network_interface_names = [
          - "lo",
          - "eth0",
        ] -> (known after apply)
        tags                    = [
            "automation",
            "ubuntu",
            "web1",
        ]
        # (18 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.webserver[1] is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "webserver" {
      ~ id                      = "502" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "10.10.20.165",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::2cb7:25ff:fe17:862e",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "2E:B7:25:17:86:2E",
        ] -> (known after apply)
        name                    = "web2.ddlns.net"
      ~ network_interface_names = [
          - "lo",
          - "eth0",
        ] -> (known after apply)
        tags                    = [
            "automation",
            "ubuntu",
            "web2",
        ]
        # (17 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (6 unchanged attributes hidden)
        }

      ~ initialization {
            # (2 unchanged attributes hidden)

          ~ user_account {
              ~ password = (sensitive value)
                # (2 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

      ~ network_device {
          - mac_address = "2E:B7:25:17:86:2E" -> null
            # (6 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

Plan: 5 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  ~ rtmp_ip               = [
      - "10.10.20.20",
    ] -> (known after apply)
  ~ webserver_ip          = [
      - "10.10.20.129",
    ] -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @dark-vex, Action: `pull_request`, Working Directory: ``, Workflow: `TF Plan on a PR (PSP)`*